Repository: pfitaxel/learn-ocaml
Catalog: translations/*.po
Languages: fr

source: INTERNAL ERROR
fr: ERREUR INTERNE

source: ERROR
fr: ERREUR

source: Cancel
fr: Annuler

source: REQUEST ERROR
fr: ERREUR DE REQUÊTE

source: Could not retrieve data from server
fr: Échec lors du téléchargement des données du serveur

source: Retry
fr: Réessayer

source: Ignore
fr: Ignorer

source: SYNC FAILED
fr: ECHEC DE LA SYNCHRONISATION

source: Could not synchronise save with the server
fr: Les données n'ont pas pu être synchronisées avec le serveur

source: %dd %02dh
fr: %dj %02dh

source: difficulty: %d / 40
fr: difficulté: %d / 40

source: No description available for this exercise.
fr: Aucune description pour cet exercice.

source: project
fr: projet

source: problem
fr: problème

source: exercise
fr: exercice

source: Clear
fr: Effacer

source: Reset
fr: Réinitialiser

source: Eval phrase
fr: Évaluer la phrase

source: Preparing the environment
fr: Préparation de l'environnement

source: Editor
fr: Éditeur

source: Report
fr: Rapport

source: Exercise
fr: Exercice

source: Details
fr: Détails

source: Click the Grade button to get your report
fr: Cliquez sur le bouton Noter pour obtenir votre rapport

source: Loading student data
fr: Chargement des informations sur les étudiants

source: Stats
fr: Statistiques

source: Exercises
fr: Exercices

source: Draft
fr: Brouillon

source: Subject
fr: Énoncé

source: Answer
fr: Réponse

source: START FROM SCRATCH
fr: TOUT RECOMMENCER

source: This will discard all your edits. Are you sure?
fr: Toutes vos modifications seront perdues. Êtes-vous sûr·e ?

source: TOKEN NOT FOUND
fr: TOKEN NON TROUVÉ

source: The entered token couldn't be recognised.
fr: Le token entré n'a pas été reconnu.

source: Reload latest graded code
fr: Reprendre le dernier code noté

source: This will replace your code with your last graded code. Are you sure?
fr: Cela va remplacer votre code par la dernière version évaluée. Êtes-vous sûr·e ?

source: Reload latest saved draft
fr: Reprendre le dernier code synchronisé

source: This will replace your code with your last saved draft. Are you sure?
fr: Cela va remplacer votre code par la dernière version synchronisée. Êtes-vous sûr·e ?

source: Reset to initial template
fr: Réinitialiser le code

source: Reload
fr: Recharger

source: Download
fr: Télécharger

source: Eval code
fr: Exécuter le code

source: OCaml prelude
fr: Prélude OCaml

source: Hide
fr: Cacher

source: Show
fr: Montrer

source: Enter your token
fr: Entrez votre token

source: Difficulty:
fr: Difficulté :

source: Kind: %s
fr: Type : %s

source: Identifier:
fr: Identifiant de l'exercice :

source: Author:
fr: Auteur :

source: Authors:
fr: Auteurs :

source: Skills trained:
fr: Compétences pratiquées :

source: Skills required:
fr: Compétences requises :

source: Previous exercises:
fr: Exercices précédents :

source: Next exercises:
fr: Exercices suivants :

source: Metadata
fr: Métadonnées

source: The toplevel has been cleared.
fr: Le toplevel a été nettoyé.

source: %d seconds!
fr: %d secondes !

source: Kill it!
fr: Le terminer !

source: Infinite loop?
fr: Boucle infinie ?

source: The toplevel has not been responding for
fr: Le toplevel ne répond plus depuis

source: seconds.
fr: secondes.

source: It will be killed in
fr: Il sera terminé dans

source: Show anyway!
fr: Afficher quand même !

source: Hide output!
fr: Masquer la sortie !

source: Flooded output!
fr: La sortie déborde !

source: Your code is flooding the %s channel.
fr: Votre code submerge le canal %s.

source: It has already printed
fr: Il a déjà affiché

source: bytes.
fr: octets.

source: Interrupted output channel %s.
fr: Canal de sortie %s interrompu.

source: Printf.printf "Welcome to OCaml %s\n%!" (Sys.ocaml_version); print_endline " - type your OCaml phrase in the box below and press [Enter]"; print_endline " - use [Shift-Enter] to break lines without triggering execution"; print_endline " - use [Ctrl-\xe2\x86\x91] once to reuse the previous entry"; print_endline " - use [Ctrl-\xe2\x86\x91] / [Ctrl-\xe2\x86\x93] to navigate through history" ;;
fr: Printf.printf "Bienvenue sur OCaml %s\n%!" (Sys.ocaml_version); print_endline " - entrez une phrase OCaml dans le champ ci-dessous et appuyez sur [Entrée]"; print_endline " - utilisez [Maj-entrée] pour passer à la ligne sans déclencher d'exécution"; print_endline " - utilisez [Ctrl-\xe2\x86\x91] pour retrouver votre entrée précédente"; print_endline " - utilisez [Ctrl-\xe2\x86\x91] / [Ctrl-\xe2\x86\x93] pour naviguer dans l'historique";;

source: The toplevel has been reset.
fr: Le toplevel a été redémarré.

source: 1 star
fr: 1 étoile

source: %d stars
fr: %d étoiles

source: No exercises found
fr: Aucun exercice trouvé

source: Loading exercises
fr: Chargement des exercices

source: Exercise closed
fr: Exercice fermé

source: Time left: %s
fr: Temps restant: %s

source: By category
fr: Par catégorie

source: By skill
fr: Par compétence

source: By difficulty
fr: Par difficulté

source: Loading playground
fr: Chargement du bac-à-sable

source: Loading lessons
fr: Chargement des cours

source: Running OCaml examples
fr: Lancement des exemples d'OCaml

source: Prev
fr: Prec.

source: Next
fr: Suiv.

source: Loading tutorials
fr: Chargement des tutoriels

source: Launching OCaml
fr: Démarrage d'OCaml

source: Loading student info
fr: Chargement des informations sur les étudiants

source: Your Learn-OCaml token
fr: Votre token Learn-OCaml

source: Your token is displayed below. It identifies you and allows to share your workspace between devices.
fr: Votre token est affiché ci-dessous. Il vous identifie et permet de partager un même espace de travail entre plusieurs machines.

source: Please write it down.
fr: Notez-le !

source: Connected as
fr: Connecté en tant que

source: Activities
fr: Activités

source: Welcome to Learn OCaml
fr: Bienvenue sur Learn OCaml

source: First connection
fr: Première connexion

source: New user? Create a new token
fr: Vous êtes nouveau ? Obtenez un nouveau token

source: Choose a nickname
fr: Choisissez un identifiant

source: Create new token
fr: Nouveau token

source: Returning user
fr: Utilisateur existant

source: Already have a token? Click here!
fr: Vous avez déjà un token ? Par ici !

source: Connect
fr: Se connecter

source: Nickname
fr: Pseudonyme

source: Send feedback to Learn-OCaml developers
fr: Envoyer un commentaire aux développeurs Learn-OCaml

source: Choose an activity.
fr: Sélectionnez une activité.

source: Tutorials
fr: Tutoriels

source: Lessons
fr: Cours

source: Playground
fr: Bac-à-sable

source: Teach
fr: Enseignement

source: Be sure to write down your token before logging out:
fr: Assurez-vous d'avoir noté votre token :

source: WARNING: the data could not be synchronised with the server. Logging out will lose your local changes, be sure you exported a backup.
fr: ATTENTION: l'espace de travail n'a pas pu être synchronisé avec le serveur. En vous déconnectant, vous perdrez tous les changements locaux, à moins d'avoir exporté votre espace de travail au préalable.

source: Logout
fr: Déconnexion

source: Show token
fr: Afficher le token

source: Sync workspace
fr: Synchroniser

source: Export to file
fr: Exporter vers un fichier

source: Import
fr: Importer

source: Download all source files
fr: Télécharger tous les fichiers sources

source: TEACHER TOKEN
fr: TOKEN PROF.

source: New teacher token created: %s write it down.
fr: Nouveau token prof. créé : %s Notez-le !

source: Open
fr: Ouvert

source: Open/Assigned
fr: Ouvert/Devoir

source: Assigned
fr: Devoir

source: Closed
fr: Fermé

source: Inconsistent
fr: Incohérent

source: Loading...
fr: Chargement...

source: any future students
fr: tout nouvel étudiant

source: Students
fr: Étudiants

source: Sort by
fr: Tri par

source: Creation date
fr: Date d'entrée

source: 1 exercise
fr: 1 exercice

source: %d exercises
fr: %d exercices

source: 1 student
fr: 1 étudiant

source: %d students
fr: %d étudiants

source: %d+ students
fr: %d+ étudiants

source: New assignment
fr: Nouveau devoir

source: Open/Close
fr: Ouvrir/Fermer

source: required skills
fr: comp. requises

source: trained skills
fr: comp. travaillées

source: Assignments
fr: Devoirs

source: Apply
fr: Appliquer

source: Create new teacher token
fr: Créer un nouveau token enseignant

source: Download the data for selected students/exercises as CSV
fr: Télécharger un CSV des exercices/étudiants sélectionnés

source: Unsaved changes
fr: Modifications non sauvegardées

source: Handling exercises
fr: Gestion des exercices

source: Handling students
fr: Gestion des étudiants

source: Handling assignments
fr: Gestion des devoirs

source: Exercise definition error %s: %a %!
fr: Erreur dans la définition de l'exercice %s: %a %!

source: Error in user code: %a %!
fr: Erreur dans le code: %a %!

source: The grader is invalid
fr: Le moteur de notation est invalide

source: Preparing the test environment.
fr: Préparation de l'environnement de test.

source: while preparing the tests
fr: lors de la préparation des tests

source: Loading your code.
fr: Chargement du code utilisateur.

source: Preparing to launch the tests.
fr: Préparation du lancement des tests.

source: while testing your solution
fr: lors du test de la solution utilisateur

source: WARNING: You have an older grader version than the server
fr: ATTENTION: La version locale du grader est plus ancienne que celle du serveur

source: Refresh the page
fr: Actualiser la page

source: I will do it myself!
fr: Je sais le faire moi-même!

source: The server has been updated, please refresh the page to make sure you are using the latest version of Learn-OCaml server (none of your work will be lost).
fr: Le serveur a été mis à jour, veuillez actualiser la page pour être sûr d'utiliser la dernière version du serveur Learn-OCaml (votre travail ne sera pas perdu).

source: TIME'S UP
fr: TEMPS ÉCOULÉ

source: The deadline for this exercise has expired. Any changes you make from now on will remain local only.
fr: La date limite de rendu de cet exercice est passée. Vos changements ne seront plus sauvegardés sur le serveur.

source: error in prelude
fr: erreur dans le prélude

source: loading the prelude...
fr: Chargement du prélude...

source: Compile
fr: Compiler

source: Grade!
fr: Noter!

source: abort
fr: abandonner

source: Grading is taking a lot of time, maybe your code is looping?
fr: La notation prend du temps, peut-être une boucle infinie dans votre code ?

source: Launching the grader
fr: Lancement de la notation

source: Grading aborted by user.
fr: Notation annulée par l'utilisateur.

source: Error in your code.
fr: Erreur dans le code.

source: Cannot start the grader if your code does not typecheck.
fr: La notation ne peut être lancée si le code ne compile pas.

source: Future assignment (starting
fr: Devoir à venir (à partir du

source: Terminated assignment (
fr: Devoir terminé (

source: Ongoing assignment (due
fr: Devoir en cours (à rendre le

source: Open exercises
fr: Exercices ouverts

source: Student stats
fr: Statistiques de l'étudiant

source: completion
fr: complétion

source: The average grade over all accessible exercises
fr: Note moyenne sur tous les exercices accessibles

source: attempted
fr: commencés

source: The amount of accessible exercises that have been attempted
fr: La proportion d'exercices accessibles qui ont été commencés

source: success
fr: réussite

source: The average grade over attempted exercises
fr: La note moyenne sur les exercices commencés

source: success over exercises training skills
fr: moyenne sur les exercices entraînant les compétences

source: Success over exercises training skill
fr: Moyenne sur les exercices entraînant la compétence

source: success over exercises requiring skills
fr: moyenne sur les exercices requérant les compétences

source: Success over exercises requiring skill
fr: Moyenne sur les exercices requérant la compétence

source: No draft available.
fr: Aucun brouillon disponible.

source: Ungraded draft, synced on:
fr: Brouillon non noté, synchronisé le :

source: GRADE DOESN'T MATCH: cheating suspected
fr: NOTE INCOHÉRENTE: suspicion de triche

source: No report available
fr: Aucun rapport

source: Status of student:
fr: Suivi étudiant :

source: Upgrade
fr: Mettre à jour

source: An e-mail will be sent to your address to confirm it.
fr: Un courriel sera envoyé à votre adresse pour la confirmer.

source: NO TOKEN
fr: PAS DE TOKEN

source: You are not logged in
fr: Vous n'êtes pas connecté

source: Your e-mail address has been confirmed. You can now login.
fr: Votre adresse e-mail a été confirmée. Vous pouvez maintenant vous connecter.

source: EMAIL CONFIRMED
fr: ADRESSE EMAIL CONFIRMÉE

source: (minimum mark)
fr: (note minimale)

source: Completed, %d pts
fr: Terminé, %d pts

source: Failed
fr: Échoué

source: Incomplete, %d pts
fr: Incomplet, %d pts

source: Exercise failed
fr: Exercice échoué

source: Exercise complete
fr: Exercice terminé

source: Exercise incomplete
fr: Exercice incomplet

source: @[<v 2>Failure: %a@]
fr: @[<v 2>Échec: %a@]

source: @[<v 2>Warning: %a@]
fr: @[<v 2>Avertissement: %a@]

source: @[<v 2>Success %d: %a@]
fr: @[<v 2>Réussite %d: %a@]

source: @[<v 2>Penalty %d: %a@]
fr: @[<v 2>Pénalité %d: %a@]

source: Error in your solution: %a %!
fr: Erreur dans votre solution: %a %!

source: Error in the exercise %s %a %!
fr: Erreur dans l'exercice %s %a %!

source: Internal error: The grader did not return a report.
fr: Erreur interne: Le moteur de notation n'a pas retourné de rapport.
